html/effj/class_interface.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>类和接口</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="klose" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="common_method.html"> UP </a>
 |
 <a accesskey="H" href="effj.html"> HOME </a>
</div><div id="content">
<h1 class="title">类和接口</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">使可见性最低</a>
<ul>
<li><a href="#sec-1-1">信息隐藏</a></li>
<li><a href="#sec-1-2">封装规则</a></li>
</ul>
</li>
<li><a href="#sec-2">使可变性最小</a>
<ul>
<li><a href="#sec-2-1">不可变类的规则</a></li>
<li><a href="#sec-2-2">不可变类的优点</a></li>
<li><a href="#sec-2-3">不可变类的缺点</a></li>
<li><a href="#sec-2-4">不可变类的诀窍</a></li>
</ul>
</li>
<li><a href="#sec-3">组合优先于继承</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">使可见性最低</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">信息隐藏</h3>
<div class="outline-text-3" id="text-1-1">
<p>
设计良好的模块会隐藏所有的实现细节，把接口和实现清晰的分离开来。模块之间通过它们之间的接口进行调用，一个模块不需要知道其他模块的内部情况
</p>
<ul class="org-ul">
<li>有效的解除系统组成各模块之间的耦合，各个模块可以独立的开发、测试、优化、使用、理解和修改
</li>
<li>加快系统开发的速度，各个模块可以并发开发
</li>
<li>减轻了维护的负担，因为可以更快的理解代码，并且在调试不影响其他的模块
</li>
<li>虽然信息隐藏本身无论是对内还是对外，都不会带来更好的性能，但是可以有效的方便优化性能：一旦完成一个系统，并通过剖析哪些模块影响了系统性能，那些模块可以进一步优化，而不影响到其他模块的正确性
</li>
<li>信息隐藏提高了可重用性，因为模块之间并不紧密相连，除了开发这些模块所使用的坏境之外，这些模块在其他坏境中往往也可用
</li>
<li>信息隐藏降低了构建大型系统的风险，因为即使整个系统不可用，但是这些独立的模块却有可能是可用的
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">封装规则</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>实例成员绝不能是public，包含public可变成员的类不是线程安全的
</li>
<li>public静态的final数组成员几乎总是错误的
</li>
<li>使共有数组变成私有的，并返回一个公有的不可变List
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Thing</span>[] <span style="color: #eedd82;">PRIVATE_VALUES</span> = {...};
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">List</span>&lt;<span style="color: #98fb98;">Thing</span>&gt; <span style="color: #eedd82;">VALUES</span> =
    Collecations.unmodifiableList(Arrays.asList(PRIVATE_VALUES));
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">&#25110;&#32773;</span>
<span style="color: #00ffff;">private</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Thing</span>[] <span style="color: #eedd82;">PRIVATE_VALUES</span> = {...};
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">final</span> <span style="color: #98fb98;">Thing</span>[] <span style="color: #87cefa;">values</span>() {
    <span style="color: #00ffff;">return</span> PRIVATE_VALUES.clone;
}
</pre>
</div>
</li>
<li>如果类可以在它所在的包的外部被访问，就提供访问私有成员的方法
</li>
<li>如果类是包私有的，或者私有的嵌套类，直接暴露他的数据成员并没有本质的错误
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">使可变性最小</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">不可变类的规则</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>不要提供任何会修改对象状态的方法
</li>
<li>保证类不会被扩展
</li>
<li>使所有的成员都是final的
</li>
<li>使所有的成员都成为私有的
</li>
<li>确保对于任何可变组件的互斥访问
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">不可变类的优点</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>不可变对象本质上是线程安全的，不要求同步
</li>
<li>不可变对象可以自由地共享
</li>
<li>永远也不需要进行保护性拷贝
</li>
<li>不仅可以共享不可变对象，甚至也可以共享他们的内部信息
</li>
<li>不可变对象对其他对象提供了大量的构件（building blocks）
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">不可变类的缺点</h3>
<div class="outline-text-3" id="text-2-3">
<p>
每一个值都需要一个单独的对象
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">不可变类的诀窍</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>让类的所有构造器都变成私有的或者包级私有的，并添加共有的静态工厂（static factory）来替代共有构造器
</li>
<li>除非有很好的理由要让类成为可变的类，否则就应该是不可变的
</li>
<li>如果类不能做成不可变的，但也应该尽量限制他的可变性
</li>
<li>除非有令人信服的理由要使域变成是非final的，否则要使每个域都是final的
</li>
<li>构造器应该创建完全初始化的对象，并建立起所有的约束关系。不要在构造器或者静态工厂之外再提供共有的初始化方法
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">组合优先于继承</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: klose</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
